In [14]:
import pandas as pd
data = {
    'nome': ['Rafael', 'João', 'Maria','Lucas','Lúcia','Ana'], 
    'Altura': [175,165,160,180,165,170],
    'sexo': ['M','M','F','M','F','F']
    }
df = pd.DataFrame(data)
df[df.Altura < 180].groupby('sexo').mean()

      Altura
sexo
F        165
M        170

In [15]:
pessoas = pd.DataFrame({'nome': ['Rafael', 'João', 'Maria','Lucas','Lúcia','Ana'], 
                        'Altura': [175,165,160,180,165,170],
                        'sexo': ['M','M','F','M','F','F']})

salarios = pd.DataFrame({'nome': ['João', 'Maria','Lucas','Lúcia','Ana','Rafael'], 
                        'salário': [1000,1200,15000,11000,12000,7000]})

pessoas.join(salarios.set_index('nome'), on='nome')

     nome  Altura sexo  salário
0  Rafael     175    M     7000
1    João     165    M     1000
2   Maria     160    F     1200
3   Lucas     180    M    15000
4   Lúcia     165    F    11000
5     Ana     170    F    12000

In [26]:
salarios = pd.DataFrame({'nome': ['João', 'Maria','Lucas','Lúcia','Ana','Rafael'], 
                   'salários': [1000,1200,15000,11000,12000,7000]})
salarios.loc[salarios.salários > 12000, 'classe'] = 'A'
salarios.loc[(salarios.salários > 7000) & (salarios.salários <= 12000), 'classe'] = 'B'
salarios.loc[salarios.salários <= 7000, 'classe'] = 'C'
salarios

     nome  salários classe
0    João      1000      C
1   Maria      1200      C
2   Lucas     15000      A
3   Lúcia     11000      B
4     Ana     12000      B
5  Rafael      7000      C